Revit 2027 API
IFCUserDefinedPropertySet.FindPropertySetByName Method
 Returns property set element by name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCUserDefinedPropertySet FindPropertySetByName(
	Document document,
	string name
)
Public Shared Function FindPropertySetByName (
	document As Document,
	name As String
) As IFCUserDefinedPropertySet
public:
static IFCUserDefinedPropertySet^ FindPropertySetByName(
	Document^ document,
	String^ name
)
static member FindPropertySetByName :
        document : Document *
        name : string -> IFCUserDefinedPropertySet
Parameters
document Document
 The document to find the property set with the specified name.
name String
 Name of the property set to find.
Return Value
IFCUserDefinedPropertySet
 The property set element, or null if not found.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCUserDefinedPropertySet Class
Autodesk.Revit.DB Namespace